Repository: lweendela/zlt-corpus-EnToi
Catalog: omegat/project_save.tmx
Source language: en
Languages: toi

source: My father got fired.
toi: Bataata baka tandwa ncito.

source: My father has many houses.
toi: Bataata ba laa maanda manji.

source: My father is not sick.
toi: Bataata ta ba cisidwe.

source: My girlfriend is a teacher.
toi: Musimbi wangu mwiiyi.

source: My girlfriend is crying.
toi: Musimbi wangu u la lila.

source: My girlfriend was crying.
toi: Musimbi wangu waka li kulila.

source: My granddaughter is listening to my wife.
toi: Muzyukulu wangu u swiilila ku mukaintu wangu.

source: My hands and legs are swollen.
toi: Maanza a maulu aangu a li zimbide.

source: My hands are bound.
toi: Maanza aangu a li angidwe.

source: My hands are clean.
toi: Maanza aangu a la salala.

source: My hands are cold.
toi: Maanza aangu a la tontola.

source: My hands are dirty.
toi: Maanza aangu a laa tombe.

source: No one knows what happened.
toi: Kunyina uu zyi caka citika.

source: No one knows your secrets.
toi: Kunyina uu zyi maseseke aako.

source: No one knows.
toi: Kunyina uu zyi.

source: No one laughed.
toi: Kunyina ooka seka.
